data = {
    "Кольцо золотое": [["золото"], 25000, 12],
    "Серьги серебряные": [["серебро"], 8000, 20],
    "Колье платиновое": [["платина"], 55000, 5],
    "Браслет комбинированный": [["золото", "серебро"], 32000, 7],
    "Подвеска с бриллиантом": [["золото", "бриллиант"], 120000, 3],
    "Часы мужские": [["сталь", "золото"], 45000, 4],
    "Цепочка женская": [["серебро"], 15000, 15],
}

bag = {}

menu = True

while menu:
    print("----------------------------------------------------------------------------------")
    print("1. Просмотр описания: название – описание\n2. Просмотр цены: название – цена.")
    print("3. Просмотр количества: название – количество.\n4. Вся информация.\n5. Покупка\n6. До свидания")
    mode = int(input("Mode: "))
    if mode == 1:
        print("----------------------------------------------------------------------------------")
        print("Список товаров и их описание")
        for k, v in data.items():
            print(f"{k} - {v[0]}")
    elif mode == 2:
        print("----------------------------------------------------------------------------------")
        print("Цены")
        for k, v in data.items():
            print(f"{k} - {v[1]} руб.")
    elif mode == 3:
        print("----------------------------------------------------------------------------------")
        print("Наличие на складе")
        for k, v in data.items():
            print(f"{k} - {v[2]} шт.")
    elif mode == 4:
        print("----------------------------------------------------------------------------------")
        print("Данные о товарах")
        for k, v in data.items():
            print(f"{k} - {v}")
    elif mode == 5:
        menu1 = True
        while menu1:
            print("----------------------------------------------------------------------------------")
            print("Товары")
            for k, v in data.items():
                print(f"{k} - {v[1]} руб., {v[2]} шт.")
            print("----------------------------------------------------------------------------------")
            print("1. Добавить товар в корзину\n2. Посмотреть корзину\n3. Выйти в меню")
            mode = int(input("Mode: "))
            if mode == 1:
                print("----------------------------------------------------------------------------------")
                t = input("Введите название товара: ")
                isT = False
                for k, v in data.items():
                    if k == t:
                        print(f"{k} - {v}")
                        n = int(input("Введите количество: "))
                        if n <= v[2]:
                            bag.update({k: [v[0], v[1], n]})
                            data.update({k: [v[0], v[1], v[2] - n]})
                            print("Добавлено в корзину!")
                            isT = True
                if not isT:
                    print("Такого товара нет!")
            if mode == 2:
                print("----------------------------------------------------------------------------------")
                if len(bag) > 0:
                    suma = 0
                    for k, v in bag.items():
                        print(f"{k} - {v}")
                        suma += v[1]
                    print(f"Общая стоимость - {suma} руб.")
                    print("1. Купить\n2. Убрать из корзины\n3. Назад")
                    mode = int(input("Mode: "))
                    if mode == 1:
                        print("----------------------------------------------------------------------------------")
                        print("Оплата прошла! Спасибо за покупку")
                        bag.clear()
                        menu1 = False
                    elif mode == 2:
                        print("----------------------------------------------------------------------------------")
                        t = input("Введите название товара: ")
                        isT = False
                        for k, v in bag.items():
                            if k == t:
                                n = v[2]
                                bag.pop(t)
                                tov = data.get(t)
                                num = tov[2]
                                data.update({k: [v[0], v[1], num + n]})
                                print("Удалено!")
                                isT = True
                                break
                        if not isT:
                            print("Такого товара нет!")
                else:
                    print("----------------------------------------------------------------------------------")
                    print("Корзина пуста!")
            elif mode == 3:
                menu1 = False
    elif mode == 6:
        menu = False